In [2]:
import pandas as pd

- Comprobamos que columnas estan limpias de pair anteriores y cuales no

In [3]:
df = pd.read_csv("definitivo_limpieza.csv", index_col=0)
df.head(5)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,fatal_(y/n),injury,date,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,"FATAL, all onboard were killed by sharks",1800,NaN,Y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,FATAL,Reported May-28-1797,May,Y,NaN
2,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,M,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,"FATAL, PROVOKED INCIDENT",12-Sep-1792,Sep,Y,M
3,1791.00.00,1791.0,Unprovoked,AUSTRALIA,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,"FATAL, ""bitten in two""",1791,NaN,Y,F
4,1788.05.10,1788.0,Boat,AUSTRALIA,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,N,"No injury to occupants, shark bit oar and rudder",10-May-1788,May,N,NaN

In [4]:
df['fecha_limpia'].unique()

array([nan, 'May', 'Sep', 'Jul', 'Aug', 'Dec', 'Mar', 'Oct', 'Apr', 'Jan',
       '500', '214', '336', '493', '725', 'Jun', 'Feb', 'and', 'the',
       'War', 'few', 'Nov', 'Mid', 'day', 'mid', 'Day'], dtype=object)

In [5]:
df['sexo'].unique()

array(['F', nan, 'M'], dtype=object)

In [6]:
df['fatal_clean'].unique()

array(['Y', 'N', nan], dtype=object)

- Nos damos cuenta que las columnas ***sex_,  fatal_(y/n)*** y ***date*** están limpias con un nuevo nombre de columna

## Ejercicio 1
- Hacemos una copia del DF

In [7]:
df_copia = df.copy()

- Eliminamos columnas innecesarias.

In [8]:
df_copia.drop(columns = ['sex_', 'href', 'fatal_(y/n)', 'date'], inplace = True)

In [9]:
df_copia.head(10)

,case_number,year,type,country,area,location,activity,name,age,time,species_,injury,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,"FATAL, all onboard were killed by sharks",NaN,Y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,FATAL,May,Y,NaN
2,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,NaN,NaN,NaN,"FATAL, PROVOKED INCIDENT",Sep,Y,M
3,1791.00.00,1791.0,Unprovoked,AUSTRALIA,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",NaN,NaN,NaN,"FATAL, ""bitten in two""",NaN,Y,F
4,1788.05.10,1788.0,Boat,AUSTRALIA,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,"No injury to occupants, shark bit oar and rudder",May,N,NaN
5,1787.07.05,1787.0,Unprovoked,NaN,St Helena,Landing Place,Swimming,Private Isaac Hicksled,NaN,NaN,NaN,FATAL,Jul,Y,M
6,1786.08.10.R,1786.0,Unprovoked,BARBADOS,NaN,NaN,Washing himself,a sailor from the York Merchant,NaN,NaN,NaN,FATAL,Aug,Y,M
7,1785.09.26.R,1785.0,Unprovoked,ENGLAND,Sussex,Brighton,NaN,NaN,NaN,NaN,Tiger shark?,Human remains recovered from shark,Sep,Y,M
8,1784.12.12,1784.0,Unprovoked,JAMAICA,NaN,Kingston,Swimming,Richard Page,NaN,22h00,NaN,NaN,Dec,Y,M
9,1783.03.02,1783.0,Sea Disaster,MARTINIQUE,NaN,Foundering of the privateer Holker,NaN,NaN,NaN,06h00,NaN,Many of the crew were taken by sharks,Mar,Y,M

## Ejercicio 2
- Eliminar duplicados

In [10]:
df_copia.duplicated().sum()

0

Vemos que no existen valores duplicados.

## Ejercicio 3
- Cambiamos el tipo de datos.

In [11]:
df_copia.dtypes

case_number      object
year            float64
type             object
country          object
area             object
location         object
activity         object
name             object
age              object
time             object
species_         object
injury           object
fecha_limpia     object
fatal_clean      object
sexo             object
dtype: object

Observamos que la columna **year** es tipo ***float*** y la querriamos de tipo ***integer***

In [12]:
df_copia['year'] = df_copia['year'].astype(dtype = 'int64', copy = True, errors = 'raise')

In [13]:
df_copia.dtypes

case_number     object
year             int64
type            object
country         object
area            object
location        object
activity        object
name            object
age             object
time            object
species_        object
injury          object
fecha_limpia    object
fatal_clean     object
sexo            object
dtype: object

## Ejercicio 4
- Cambiar a minuscula en la columna 'country'

In [ ]:
df_copia["media_reclamaciones"] = df_copia.apply(lambda pepe: media_reclamaciones( # en este caso, no especificamos el nombre de la columna, haremos el apply sobre todo el dataframe. Dentro del apply iniciamos el lambda que recibirá unos datos. En este caso todo el dataframe 
                                        pepe['total_claim_amount'], pepe['number_of_open_complaints']), # especificamos las columnas sobre las que queremos aplicar el apply
                                        axis = 1)

In [20]:
df_country = pd.DataFrame(df_copia['country'])
df_country

         country
0     SEYCHELLES
1            NaN
2        ENGLAND
3      AUSTRALIA
4      AUSTRALIA
...          ...
6279   AUSTRALIA
6280         USA
6281   AUSTRALIA
6282       INDIA
6283         NaN

[6284 rows x 1 columns]

In [21]:
df_country = df_country.apply(df_country.lower())

AttributeError: 'DataFrame' object has no attribute 'lower'